/***************************************************************
*  Структуры и алгоритмы обработки данных:                     *
*  объектно-ориентированный подход и реализация на C++         *
*      Глава 6. Алгоритмы обработки сетевой информации         *
*          6.3. Определение остовных деревьев                  *
*                                                              *
*  Автор    : А.Кубенский                                      *
*  Файл     : infinity.h                                       *
*  Описание : Определение "бесконечно большого" значения       *
***************************************************************/

#ifndef __INFINITY_H
#define __INFINITY_H

const double INFINITY = 10000;

#endif
