/***************************************************************
*  Структуры и алгоритмы обработки данных:                     *
*  объектно-ориентированный подход и реализация на C++         *
*      Глава 2. Базовые алгоритмы                              *
*          2.4. Итераторы                                      *
*                                                              *
*  Автор       : А. Кубенский                                  *
*  Файл        : Summator.h                                    *
*  Описание    : Описание класса для итерации списка:          *
*                суммирование                                  *
***************************************************************/

#ifndef __SUMMATOR_H
#define __SUMMATOR_H

#include "Actor.h"

class Summator : public Actor {
  int sum;
public:
  Summator() : sum(0) {}
  int getSum() { return sum; }
  void action(int & element) { sum += element; }
};

#endif
