/***************************************************************
*  Структуры и алгоритмы обработки данных:                     *
*  объектно-ориентированный подход и реализация на C++         *
*      Глава 2. Базовые алгоритмы                              *
*          2.3. Стеки и очереди                                *
*                                                              *
*  Автор    : А.Кубенский                                      *
*  Файл     : calc.h                                           *
*  Описание : Функции для вычисления значения выражения на     *
*             двух стеках                                      *
***************************************************************/

#ifndef __CALC_H
#define __CALC_H

#include <exception>

using namespace std;

//==============================================================
// Исключительная ситуация WrongExpression возникает
// при обнаружении ошибки в вычисляемом выражении.
//==============================================================

class WrongExpression : public exception {
  char * reason;
public:
  WrongExpression() : reason("Wrong expression") {}
  const char * what() const throw() { return reason; }
};

// Объявление функции

int exprValue(char * expr);

#endif
