/***************************************************************
*  Структуры и алгоритмы обработки данных:                     *
*  объектно-ориентированный подход и реализация на C++         *
*      Глава 8. Функции как носитель информации                *
*          8.2. Задача о расстановке ферзей на шахматной доске *
*               и другие задачи                                *
*                                                              *
*  Автор       : А. Кубенский                                  *
*  Файл        : queens.h                                      *
*  Описание    : Объявление функций, реализующих традиционные  *
*                алгоритмы решения задачи о расстановке ферзей *
*                на шахматной доске                            *
***************************************************************/

#ifndef __QUEEN_H
#define __QUEEN_H

int * queen(int n);
int * queen1(int n);

#endif
