/***************************************************************
*  Структуры и алгоритмы обработки данных:                     *
*  объектно-ориентированный подход и реализация на C++         *
*      Глава 1. Способы представления структур данных          *
*          1.5. Графы                                          *
*                                                              *
*  Автор    : А.Кубенский                                      *
*  Файл     : ListGraph.cpp                                    *
*  Описание : Определение реализации методов класса ListGraph  *
***************************************************************/

#include "ListGraph.h"

//**************************************************************
// Методы класса ListGraph
//**************************************************************

// Добавление дуги
void ListGraph::addArc(int from, int to) {
  if (from < 0 || from >= vertexNumber || to < 0 || to >= vertexNumber)
    return;          // Неправильно задана дуга
  graph[from].add(to);
}

// Поиск дуги
bool ListGraph::hasArc(int from, int to) const {
  if (from < 0 || from >= vertexNumber || to < 0 || to >= vertexNumber)
    return false;    // Неправильно задана дуга
  return graph[from].has(to);
}
